In [1]:
import pandas as pd

# Applying Functions in Pandas

In [2]:
# Sample DataFrame
df = pd.DataFrame({
    "Name": ["Onkar", "Amit", "Sara", "Rohit"],
    "Age": [21, 25, 23, 29],
    "Salary": [50000, 65000, 55000, 70000]
})

df

    Name  Age  Salary
0  Onkar   21   50000
1   Amit   25   65000
2   Sara   23   55000
3  Rohit   29   70000

## 1. `map()` - Element-wise operation on a Series
Use `map()` when working with one column and want to transform each value.  
Note: Works only on Series and also returns a Series.

1.

In [3]:
level_map = {
    21: "Junior",
    25: "Mid",
    23: "Junior",
    29: "Senior"
}

df["Level"] = df["Age"].map(level_map)
df

    Name  Age  Salary   Level
0  Onkar   21   50000  Junior
1   Amit   25   65000     Mid
2   Sara   23   55000  Junior
3  Rohit   29   70000  Senior

2.

In [4]:
df["Salary_lakhs"] = df["Salary"].map(lambda x: x / 100000)
df

    Name  Age  Salary   Level  Salary_lakhs
0  Onkar   21   50000  Junior          0.50
1   Amit   25   65000     Mid          0.65
2   Sara   23   55000  Junior          0.55
3  Rohit   29   70000  Senior          0.70

## 2. `apply()` - Row-wise or Column-wise logic
Use apply for row/column wise logic.

In [6]:
# 1. Column wise
df[["Age", "Salary"]].apply("mean")

# Equivalent to 
# df[["Age", "Salary"]].mean()

Age          24.5
Salary    60000.0
dtype: float64

In [14]:
# 2. Row-wise
df["Category"] = df.apply(
    lambda row: "High Erner" if row["Salary"] > 60000 else "Normal",
    axis=1
)
# Here used apply function on df so mentioned axis=1. 
# We called wntire df so used row["Salary"] - mentioned column name
df

    Name  Age  Salary   Level  Salary_lakhs    Category
0  Onkar   21   50000  Junior          0.50      Normal
1   Amit   25   65000     Mid          0.65  High Erner
2   Sara   23   55000  Junior          0.55      Normal
3  Rohit   29   70000  Senior          0.70  High Erner

In [15]:
# 3. Similar
df["Category"] = df["Salary"].apply(
    lambda row: "High Erner" if row > 60000 else "Normal"
)
# Here we just applyed apply on a Series
# No need to mention axis=1
df

    Name  Age  Salary   Level  Salary_lakhs    Category
0  Onkar   21   50000  Junior          0.50      Normal
1   Amit   25   65000     Mid          0.65  High Erner
2   Sara   23   55000  Junior          0.55      Normal
3  Rohit   29   70000  Senior          0.70  High Erner

## 3. `map` vs `apply`

| Function | Works On | Level | Use |
|-|-|-|-|
|`map()`|Series|Element|Value mapping|
|`apply()`|Series/DataFrame|Row/Column|Custom logic|

## 4. Performance Rule (VERY IMPORTANT)

In [18]:
df["Salary"] * 0.10

0    5000.0
1    6500.0
2    5500.0
3    7000.0
Name: Salary, dtype: float64

---
# Note: 
### **Vectorized Operation > map > apply > applymap**

---
# Summary
1. `map()` - `df["col"].map(lambda x: x+1)`  
    Use only for Series and when want to change each value
2. `apply()` - `df.apply("mean", numeric_only=True)` /-/ `df.apply(fun)`  
    For column/row level logic.
3. `df["col"] = df["new_col"] + 1`  
    Vectorized operations > map > apply > applymap